[
  ["Corrupt Nature Spirit", 12, 14, 1, 6, 0, 6,
    ["summons vines that lash at you", "summons thorns from the ground", "spits out a cloud of insects at you"],
    100, 50,
    ["\nA tainted and corrupt spirit emerges from the trees.\n'Leave this place, fiend!' it howls.",
      "\n'You shall not disturb this grove!' it screeches.",
      "\n'If you seek death, you have found it!' it roars, sprouting glowing thorns from its hind."], 8],

  ["Vampire Lord Vasilius", 16, 18, 2, 8, 1, 6,
    ["flies down to bite you", "seeks to rend you with his nails", "unleashes necromantic magic at you"],
    250, 100,
    ["\nA well dressed male descends from the sky.\n'Welcome. You are just in time for dinner...' he laughs.",
      "\n'I am the mist, and I am the land! Kneel!' he yells.",
      "\n'I will drink this world dry!' he screams, sprouting bat-like wings and lunging at you."], 10],

  ["Ancient Hag Baba Yurga", 20, 22, 1, 10, 2, 8,
    ["laughs maddeningly", "chants in demonic tongues", "breathes out a poison cloud"],
    350, 200,
    ["\nYou approach a cozy hut, in the middle of the swamp.\nAn old lady steps out, holding a fresh pie and cackles.",
      "\n'Rude child, I shall have to force feed you!' the hag screams as her chin, nose, and fingers start elongating.",
      "\n'I shall cook and eat you!' the hag screams, completing her transformation with green skin and bulbous warts."], 12],

  ["Avatar of Antaboros, Serpent God", 24, 26, 1, 12, 3, 8,
    ["conjures a rain of serpents", "swings with its six scimitars", "bites down with all of its serpent heads"],
    700, 300,
    ["\nA gollosal humanoid body steps forth, emerging out of the altar. It has six arms, each wielding a scimitar. \nInstead of a head, it has a hundred coiled serpents.",
      "\n'I have devoured countless-sss worlds-sss, and this-sss one shall be no different' the colossal entity hisses.",
      "\n'You witness-sss Antaboros-sss, Herald of the End Times-sss' it belches, as the temple walls begin to slither, and the hissing becomes omnipresent."], 16],

  ["Cosmic Sentience", 25, 26, 1, 14, 4, 8,
    ["summons down a meteor", "teleports you to a freezing planet", "casts you through the cosmos"],
    2100, 400,
    ["\nThe meteor pulses with a strange colour. You find yourself in an infinite space. \nA floating white geometric entity hovers above you.",
      "\n'Aaggzz Tthhrrkk Pprrxx' the entity voices a strange noise. Its arms separate into tentacles.",
      "\nThe infinite white space around you begins to crack, and a green and purple glow pulses through. Shards of reality hover around you."], 18],

  ["Anthereos, The Sphinx Pharaoh", 26, 30, 2, 16, 5, 8,
    ["launches an arcane bolt at you", "charges at you with its claws", "shoots down a beam of solar energy"],
    4000, 400,
    ["\nA majestic creature with the body of a lion, large wings, and a human head descends. \n'Kneel' it commands, as the sun rotates in the sky to hover behind it.",
      "\n'The sands are eternal, and so am I' the sphinx proclaims, its eyes now glowing azure.",
      "\nThe sphinx flies up, and the sky turns black. The sun remains as a small white orb, resting atop the crown of the sphinx."], 18],

  ["theAfterLife_Protocol(#)", 26, 30, 2, 18, 6, 8,
    ["turns on wall-mounted laser turrets", "activates a laser grid that spins around the chamber", "calls forth missile drones"],
    6000, 400,
    ["\nYou enter a room filled with glass canisters, each containing a body suspended in deep green liquid. \n'Systems activate' a female voice booms from the speakers.",
      "\n'Chance of survival at 50%, initiate perseverance modules' the speakers announce. Some of the canisters open, and limp lifeless bodies collapse on the floor.",
      "\n'Survival chance at @#@!%, purging specimens with sub 95-percentile strategy efficiency.'. More bodies fall out of their tubes. Some attempt to crawl away."], 20],

  ["Malefius, Demon-Lich", 28, 30, 3, 18, 7, 10,
    ["launches a fireball", "summons a flaming skull and throws it at you", "swings with his necroflame blade"],
    10000, 400,
    ["\nA demonic, winged creature stands in front of you. It turns to face you, revealing torn, blackened red skin, which glows green underneath.",
      "\n'I have conquered death, what can you hope to achieve?' the undead demon taunts you.",
      "\nA ghostly shape appears. 'Avenge us' it pleads. As it disappears, a pendant remains on the scorched earth beneath. \n'My phylactery! HOW!?' the demon screams."], 22],

  ["Kath'Shagurrath, Celestial Pathogen", 30, 32, 3, 18, 8, 10,
    ["pulls down an obelisk, throwing it at you", "summons orbs of green tentacles that flail uncontrollably", "whispers inside your mind"],
    15000, 400,
    ["\nAn octopus-like head emerges from the chasm. Massive hands pull up a bat-winged upper body covered in pulsing blue veins.",
      "\nAn old man's voice whispers, tearfully, in your mind's ear, 'My child... What have you done with it?'. \nImages of a pulsating meteor flash before your eyes.",
      "\nA woman sings through static hiss in your mind. You see the infinite cosmos, and beyond it, countless eyes. \n'Where is my mind' the lady sings operatically."], 26]
]